landracer/opendash/openDstream/sdkconfig.defaults
# Licensed under Sovereign Individual License v1.0 — see LICENSE file
#
# ─────────────────────────────────────────────────────────────────────────────
# openDstream Node — SDK Configuration Defaults
#
# Hardware: ESP32-S3 (any variant with USB_SERIAL_JTAG)
# Role: ESP-NOW slave → SERIALOUT_BINARY USB relay to PC (multidisplay-app)
# Headless: No display, no LVGL — pure data relay
# ─────────────────────────────────────────────────────────────────────────────

#
# Target Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Flash Configuration
#
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#
# ESP32S3-Specific Configuration
#
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

#
# Memory Configuration — no PSRAM needed (headless)
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

#
# FreeRTOS Configuration
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

#
# Task Watchdog
#
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

#
# USB SERIAL JTAG — required for openDstream
#
CONFIG_USB_SERIAL_JTAG_DRIVER_ENABLE_DTR=y
CONFIG_USB_SERIAL_JTAG_DRIVER_ENABLE_RTS=false
CONFIG_USB_SERIAL_JTAG_RX_BUFFER_SIZE=512
CONFIG_USB_SERIAL_JTAG_TX_BUFFER_SIZE=512

#
# ESP-NOW Configuration
#
CONFIG_ESP_NOW_SUPPORT_ENABLED=y
CONFIG_ESP_NOW_SUPPORT_WIFI_STA=y
CONFIG_ESP_NOW_SUPPORT_WIFI_AP=n

#
# WiFi Configuration
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_SOFTBEARER_TX_ANCH=0

#
# Logging
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

#
# Compiler Options
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
